
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |   🔴 Destroy |
|----------:|---------:|----------:|-------------:|
|        ✅ |        4 |         0 |            3 |
## Affected resources by action

|  Action  | Resources                                                     |
|:--------:|:--------------------------------------------------------------|
|    🟢    | `module.cost-alert.aws_cloudwatch_metric_alarm.periodic_cost` |
|    🟢    | `module.cost-alert.aws_sns_topic.cost_notifications`          |
|    🟢    | `module.cost-alert.aws_sns_topic_subscription.cost_emails`    |
|    🟢    | `module.cost-alert.random_string.alert-suffix`                |
|    🔴    | `aws_cloudwatch_metric_alarm.daily-spend`                     |
|    🔴    | `aws_sns_topic.cost_notifications`                            |
|    🔴    | `aws_sns_topic_subscription.cost_emails`                      |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.daily-spend will be destroyed
  # (because aws_cloudwatch_metric_alarm.daily-spend is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "daily-spend" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:us-east-1:990466748045:cost-daily-20241028191107149400000002",
        ] -> null
      - alarm_name                            = "daily_cost" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-1:990466748045:alarm:daily_cost" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 1 -> null
      - dimensions                            = {} -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "daily_cost" -> null
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - period                                = 0 -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "created_by" = "infrahouse/aws-control-990466748045"
        } -> null
      - threshold                             = 18 -> null
      - treat_missing_data                    = "missing" -> null
        # (8 unchanged attributes hidden)

      - metric_query {
          - id          = "m1" -> null
          - period      = 0 -> null
          - return_data = false -> null
            # (3 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "Currency" = "USD"
                } -> null
              - metric_name = "EstimatedCharges" -> null
              - namespace   = "AWS/Billing" -> null
              - period      = 86400 -> null
              - stat        = "Maximum" -> null
                # (1 unchanged attribute hidden)
            }
        }
      - metric_query {
          - expression  = "RATE(m1) * 24 * 3600" -> null
          - id          = "e1" -> null
          - label       = "Daily cost" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_sns_topic.cost_notifications will be destroyed
  # (because aws_sns_topic.cost_notifications is not in configuration)
  - resource "aws_sns_topic" "cost_notifications" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:us-east-1:990466748045:cost-daily-20241028191107149400000002" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:us-east-1:990466748045:cost-daily-20241028191107149400000002" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "cost-daily-20241028191107149400000002" -> null
      - name_prefix                              = "cost-daily-" -> null
      - owner                                    = "990466748045" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "990466748045"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:990466748045:cost-daily-20241028191107149400000002"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {
          - "created_by" = "infrahouse/aws-control-990466748045"
        } -> null
        # (16 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.cost_emails will be destroyed
  # (because aws_sns_topic_subscription.cost_emails is not in configuration)
  - resource "aws_sns_topic_subscription" "cost_emails" {
      - arn                             = "arn:aws:sns:us-east-1:990466748045:cost-daily-20241028191107149400000002:9f8b6115-89ef-4608-8b99-66fb08780edf" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = false -> null
      - endpoint                        = "aleks@infrahouse.com" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:990466748045:cost-daily-20241028191107149400000002:9f8b6115-89ef-4608-8b99-66fb08780edf" -> null
      - owner_id                        = "990466748045" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "email" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:990466748045:cost-daily-20241028191107149400000002" -> null
        # (6 unchanged attributes hidden)
    }

  # module.cost-alert.aws_cloudwatch_metric_alarm.periodic_cost will be created
  + resource "aws_cloudwatch_metric_alarm" "periodic_cost" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = (known after apply)
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 1
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-990466748045"
        }
      + threshold                             = 18
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "Currency" = "USD"
                }
              + metric_name = "EstimatedCharges"
              + namespace   = "AWS/Billing"
              + period      = 86400
              + stat        = "Maximum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "RATE(m1) * 1 24 * 3600"
          + id          = "e1"
          + label       = "Daily cost"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # module.cost-alert.aws_sns_topic.cost_notifications will be created
  + resource "aws_sns_topic" "cost_notifications" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "cost-periodic-"
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "created_by" = "infrahouse/aws-control-990466748045"
        }
      + tracing_config              = (known after apply)
    }

  # module.cost-alert.aws_sns_topic_subscription.cost_emails will be created
  + resource "aws_sns_topic_subscription" "cost_emails" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "aleks@infrahouse.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.cost-alert.random_string.alert-suffix will be created
  + resource "random_string" "alert-suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDQsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDN9fQ==
```
</details>